<template>
  <main class="vacancies pb-12">
    <div class="container">
      <h2 class="text__big-2 py-8 text-center">Вакансии</h2>
      <ul class="">
        <li v-for="(vc, i) in store.vacancies" :key="vc.id">
          <VacancyCard :vacancy="vc" :isLeft="i % 2 == 0" />
        </li>
      </ul>
    </div>
  </main>
</template>

<script setup>
import img from "/src/assets/images/seller.png";
import VacancyCard from "/src/components/cards/vacancy.vue";
import { useVacanciesStore } from "../stores/vacancies";
const store = useVacanciesStore();
store.getVacancies();
const vacancies = [
  {
    id: 0,
    title: "Продавец",
    desc: "от 3 000 000 до 10 000 000 сум на руки",
    image: img,
    leftImg: true,
    requirements: [
      {
        title: "Кого мы ищем?",
        requirement: [
          "с опытом от 1 года (Обязательно)",
          "Активных и коммуникабельных любого пола",
          "Для нас очень важно знание русского и узбекского языков- Клиентоориентированных, готовых обучаться и много зарабатывать в дружном коллективе.",
        ],
      },
      {
        title: "Что входит в задачи?",
        requirement: [
          "Оформление магазина (выкладка товара)",
          "Консультирование и помощь клиентам;",
          "Участие в проведении инвентаризации",
          "Поддержание чистоты и порядка",
        ],
      },
    ],
  },
  {
    id: 1,
    title: "Продавец",
    desc: "от 3 000 000 до 10 000 000 сум на руки",
    image: img,
    leftImg: false,
    requirements: [
      {
        title: "Кого мы ищем?",
        requirement: [
          "с опытом от 1 года (Обязательно)",
          "Активных и коммуникабельных любого пола",
          "Для нас очень важно знание русского и узбекского языков- Клиентоориентированных, готовых обучаться и много зарабатывать в дружном коллективе.",
        ],
      },
      {
        title: "Что входит в задачи?",
        requirement: [
          "Оформление магазина (выкладка товара)",
          "Консультирование и помощь клиентам;",
          "Участие в проведении инвентаризации",
          "Поддержание чистоты и порядка",
        ],
      },
    ],
  },
  {
    id: 2,
    title: "Продавец",
    desc: "от 3 000 000 до 10 000 000 сум на руки",
    image: img,
    leftImg: true,
    requirements: [
      {
        title: "Кого мы ищем?",
        requirement: [
          "с опытом от 1 года (Обязательно)",
          "Активных и коммуникабельных любого пола",
          "Для нас очень важно знание русского и узбекского языков- Клиентоориентированных, готовых обучаться и много зарабатывать в дружном коллективе.",
        ],
      },
      {
        title: "Что входит в задачи?",
        requirement: [
          "Оформление магазина (выкладка товара)",
          "Консультирование и помощь клиентам;",
          "Участие в проведении инвентаризации",
          "Поддержание чистоты и порядка",
        ],
      },
    ],
  },
  {
    id: 3,
    title: "Продавец",
    desc: "от 3 000 000 до 10 000 000 сум на руки",
    image: img,
    leftImg: false,
    requirements: [
      {
        title: "Кого мы ищем?",
        requirement: [
          "с опытом от 1 года (Обязательно)",
          "Активных и коммуникабельных любого пола",
          "Для нас очень важно знание русского и узбекского языков- Клиентоориентированных, готовых обучаться и много зарабатывать в дружном коллективе.",
        ],
      },
      {
        title: "Что входит в задачи?",
        requirement: [
          "Оформление магазина (выкладка товара)",
          "Консультирование и помощь клиентам;",
          "Участие в проведении инвентаризации",
          "Поддержание чистоты и порядка",
        ],
      },
    ],
  },
];
</script>
